export default function Info() {
  return (
    <>
      <div>
        <h2>اللعبة أدوارها كده:</h2>
        <ul>
          <li>
            <strong>المافيا:</strong> دورهم يقتلوا واحد من الناس كل دور.
          </li>
          <li>
            <strong>الطبيب:</strong> دوره يختار حد يعالجه، ولو الشخص ده المافيا
            حاولوا يقتلوه، يفضل عايش.
          </li>
          <li>
            <strong>المفتش:</strong> دوره يحدد واحد يشوف إذا كان مافيا ولا لأ.
          </li>
        </ul>

        <h2>اللعبة بتشتغل كده:</h2>
        <ol>
          <li>كل واحد يشوف دوره في اللعبة على الجوال.</li>
          <li>
            كل دور يبدأ: المافيا تختار حد تقتله، الطبيب يختار مين يعالجه،
            والمفتش يحقق في واحد.
          </li>
          <li>
            بعد كده، اللعبة تقول مين مات (لو الطبيب ماعالجوش)، والناس كلها تبدأ
            تناقش مين المافيا وتقرر تطلع حد لو شكوا فيه.
          </li>
        </ol>

        <h2>الهدف:</h2>
        <ul>
          <li>
            <strong>المافيا:</strong> تخلصوا على كل المواطنين قبل ما يكشفوكم.
          </li>
          <li>
            <strong>المواطنين:</strong> تكتشفوا المافيا وتخرجوا كل أفرادهم من
            اللعبة.
          </li>
        </ul>

        <p>
          بسيطة وحماسية، وكل واحد بيعرف دوره بوضوح من الجوال عشان يبقى الموضوع
          سهل ومنظم. 😊
        </p>
      </div>
    </>
  );
}
